## 四、缺失值处理

**1、发现缺失值**

In [1]:
import pandas as pd
import numpy as np

data = pd.DataFrame(np.array([[1, np.nan, 2],
                              [np.nan, 3, 4],
                              [5, 6, None]]), columns=["A", "B", "C"])
data

     A    B     C
0    1  NaN     2
1  NaN    3     4
2    5    6  None

**注意：有None、字符串等，数据类型全部变为object，它比int和float更消耗资源**

In [2]:
data.dtypes

A    object
B    object
C    object
dtype: object

In [3]:
data.isnull()

       A      B      C
0  False   True  False
1   True  False  False
2  False  False   True

In [4]:
data.notnull()

       A      B      C
0   True  False   True
1  False   True   True
2   True   True  False

**2、删除缺失值**

In [6]:
data = pd.DataFrame(np.array([[1, np.nan, 2, 3],
                              [np.nan, 4, 5, 6],
                              [7, 8, np.nan, 9],
                              [10, 11 , 12, 13]]), columns=["A", "B", "C", "D"])
data

      A     B     C     D
0   1.0   NaN   2.0   3.0
1   NaN   4.0   5.0   6.0
2   7.0   8.0   NaN   9.0
3  10.0  11.0  12.0  13.0

**注意：np.nan是一种特殊的浮点数**

In [7]:
data.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

**（1）删除整行**

In [8]:
data.dropna()

      A     B     C     D
3  10.0  11.0  12.0  13.0

**（2）删除整列**

In [9]:
data.dropna(axis="columns")

      D
0   3.0
1   6.0
2   9.0
3  13.0

In [10]:
data["D"] = np.nan
data

      A     B     C   D
0   1.0   NaN   2.0 NaN
1   NaN   4.0   5.0 NaN
2   7.0   8.0   NaN NaN
3  10.0  11.0  12.0 NaN

In [13]:
data.dropna(axis="columns", how="all")

      A     B     C
0   1.0   NaN   2.0
1   NaN   4.0   5.0
2   7.0   8.0   NaN
3  10.0  11.0  12.0

In [14]:
data.dropna(axis="columns", how="any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
data.loc[3] = np.nan
data

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  4.0  5.0 NaN
2  7.0  8.0  NaN NaN
3  NaN  NaN  NaN NaN

In [16]:
data.dropna(how="all")

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  4.0  5.0 NaN
2  7.0  8.0  NaN NaN

**3、填充缺失值**

In [18]:
data = pd.DataFrame(np.array([[1, np.nan, 2, 3],
                              [np.nan, 4, 5, 6],
                              [7, 8, np.nan, 9],
                              [10, 11 , 12, 13]]), columns=["A", "B", "C", "D"])
data

      A     B     C     D
0   1.0   NaN   2.0   3.0
1   NaN   4.0   5.0   6.0
2   7.0   8.0   NaN   9.0
3  10.0  11.0  12.0  13.0

In [19]:
data.fillna(value=5)

      A     B     C     D
0   1.0   5.0   2.0   3.0
1   5.0   4.0   5.0   6.0
2   7.0   8.0   5.0   9.0
3  10.0  11.0  12.0  13.0

* 用均值进行替换

In [21]:
fill = data.mean()
fill

A    6.000000
B    7.666667
C    6.333333
D    7.750000
dtype: float64

In [22]:
data.fillna(value=fill)

      A          B          C     D
0   1.0   7.666667   2.000000   3.0
1   6.0   4.000000   5.000000   6.0
2   7.0   8.000000   6.333333   9.0
3  10.0  11.000000  12.000000  13.0

In [27]:
fill = data.stack().mean()
fill

7.0

In [28]:
data.fillna(value=fill)

      A     B     C     D
0   1.0   7.0   2.0   3.0
1   7.0   4.0   5.0   6.0
2   7.0   8.0   7.0   9.0
3  10.0  11.0  12.0  13.0